app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @reported_posts = Post.reported_posts

    @posts = if current_user.is_moderator?
               Post.all